wintersmith/contents/articles/Data/2015-09-05-token-bucket.html
---
date: 2015-09-05 23:41:34
template: tech.jade
title: Token Bucket / Leaky Bucket
category: Data
chage_frequency: monthly
tag: Data
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Token Bucket</a></li>
<li><a href="#sec-2">Leaky Bucket</a>
<ul>
<li><a href="#sec-2-1">As a Meter（速率测量）</a></li>
<li><a href="#sec-2-2">As a Queue（速率控制）</a></li>
</ul>
</li>
<li><a href="#sec-3">HTB (Hierarchy Token Bucket)</a></li>
<li><a href="#sec-4">CBQ (Class Based Queue)</a></li>
<li><a href="#sec-5">流控与流量整形</a></li>
</ul>
</div>
</div>
<p>
本文介绍一些流控的模型。
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Token Bucket</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://en.wikipedia.org/wiki/Token_bucket">Token Bucket</a> 是一个数学模型，如下图：
</p>

<pre class="example">
  Fill constant rate
    |
    |
    |
    |
    V
+--------+
|        |    \
|        |     \
|   B    |      \
|   u    |       |
|   c    |       |   Bucket Depth = L
|   k    |       |
|   e    |       /
|   t    |      /
|        |     /
|        |    /
+---+----+
    ^
    |
    |
    |
    |
  Take
</pre>

<p>
一个固定长度的Bucket，深度为L，深度越大，所能接受得突发（burst）越大。
</p>

<p>
算法以固定的速率r，向桶中添加Token，如果桶已满，则溢出的Token丢弃。
</p>

<p>
使用Token Bucket的程序在处理数据前，根据数据量换算为要获取的Token数量，然后从Bucket中Take出Token，根据Token数进行发送相应数量的数据。
</p>

<p>
多出来的数据可以选择丢弃、延迟处理。
</p>

<p>
当Bucket满时，如果有突发量的获取Token，那么可以获取L个数的Token，这时，获取的Token速率远大于填充Bucket的速率，称为突发速率。
</p>

<p>
TokenBucket的目标是实现流量的平均速率控制，同时允许突发流量。
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Leaky Bucket</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://en.wikipedia.org/wiki/Leaky_bucket">Leaky Bucket</a> 与Token Bucket类似，但是它除了用作限速外，还可以实现不允许突发流量的功能。
</p>

<p>
Leaky Bucket 有2种使用方式：
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">As a Meter（速率测量）</h3>
<div class="outline-text-3" id="text-2-1">
<p>
作用上与Token Bucket完全一样，用来进行流量整形，允许一定的突发流量。
</p>
<pre class="example">
  Put imimmediately
     |
     |
     |
     |
     |
     V
+---------+
|         |
|    B    |
|    u    |
|    c    |
|    k    |
|    e    |
|    t    |
|         |
|         |
+----+----+
     |
     |
     |
     |
     |
     V
Leak constant rate
</pre>
<p>
注意，这里仅仅是判断Bucket是否还有容量，如果有则放入一定数量Token，然后立即发送这批数据。
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">As a Queue（速率控制）</h3>
<div class="outline-text-3" id="text-2-2">
<p>
流量的通过完全由Bucket进行控制，不允许突发流量，流量是均衡的。
</p>
<pre class="example">
  Put imimmediately
     |
     |
     |
     |
     |
     V
+---------+
|         |
|    B    |
|    u    |
|    c    |
|    k    |
|    e    |
|    t    |
|         |
|         |
+----+----+
     |
     |
     |
     |
     |
     V
Take constant rate
</pre>
<p>
注意，这里数据包会真正放入到Bucket中，然后从另一头取出来，再进行发送。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">HTB (Hierarchy Token Bucket)</h2>
<div class="outline-text-2" id="text-3">
<p>
HTB 是Token Bucket的高级版，Linux trafic control中有使用到。可以参考tc手册。
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">CBQ (Class Based Queue)</h2>
<div class="outline-text-2" id="text-4">
<p>
按照类别进行分类的流控
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">流控与流量整形</h2>
<div class="outline-text-2" id="text-5">
<p>
流控与流量整形在网络中普遍应用。在交换机中、路由器中已经成熟使用。Linux 系统支持的流量控制非常丰富。linux 的 tc命令可以设置流量控制的规则到内核。具体可以参见 <a href="http://linux-ip.net/articles/Traffic-Control-HOWTO/">Trafic Control HOWTO</a> 。
</p>
</div>
</div>
